3D/exp1/system/changeToOmega
#!/bin/bash

mv fvSchemes fvSchemes.kEpsilon
mv fvSolution fvSolution.kEpsilon
mv fvSchemes.omega fvSchemes
mv fvSolution.omega fvSolution
